export const cardData = [
  {
    image: "/badge.png",
    title: "Υψηλής ποιότητας",
    text: "Παρέχουμε αξιόπιστη προμήθειαβιομηχανικών και ιατρικών αερίων υψηλής ποιότητας. Η επιλογή μας περιλαμβάνει ακετυλένιο, αργό, ήλιο και διάφορα μείγματα αερίων, εξασφαλίζοντας ασφαλή και αποτελεσματική χρήση για τις ανάγκες σας.",
  },
  {
    image: "/prevention.png",
    title: "Υγεία & πρόληψη",
    text: "Παρέχουμε ιατρικά αέρια υψηλής καθαρότητας σε φιάλες, συμπεριλαμβανομένων οξυγόνου, ηλίου και διαφόρων μειγμάτων αερίων. Τα προϊόντα μας πληρούν αυστηρά πρότυπα ποιότητας για ιατρική χρήση στην Ελλάδα.",
  },
  {
    image: "/delivery.png",
    title: "Άμεση παράδοση",
    text: "Παρέχουμε γρήγορη παράδοση βιομηχανικών και ιατρικών αερίων σε φιάλες. Είτε χρειάζεστε οξυγόνο, ακετυλένιο, αργό ή άζωτο, η αξιόπιστη υπηρεσία μας διασφαλίζει ότι οι ανάγκες σας σε προμήθεια θα καλύπτονται άμεσα.",
  },
  {
    image: "/insurance.png",
    title: "Πιστοποιημένος έλεγχος φιαλών",
    text: "Η ομάδα μας παρέχει πιστοποιημένες επιθεωρήσεις κυλίνδρων αερίου. Διασφαλίζουμε ότι πληρούν τα πρότυπα και τους κανονισμούς ασφαλείας, παρέχοντάς σας ηρεμία και αξιόπιστη απόδοση.",
  },
];

export const container = {
  hidden: { opacity: 0 },
  show: {
    opacity: 1,
    transition: {
      delay: 0.3,
      staggerChildren: 0.7,
    },
  },
};


export const item = {
  hidden: { opacity: 0, y: 30 },
  show: {
    opacity: 1,
    y: 0,
    transition: {
      duration: 0.8,       // slower animation
      ease: "easeOut",
    },
  },
};